БухЭксп/DataProcessors/CW_РеестрыНДС0ПакетноеФормированиеЗаписейРеестров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_РеестрыНДС0ПакетноеФормированиеЗаписейРеестров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ДоходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ДоходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДоходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Comment>Актируемый счёт</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеестрыНДС0Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_РеестрыНДС0СтатусыЗаписиРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеестрыНДС0СтатусыЗаписиРеестра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОграниченияПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаиморасчетыВУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляВыявленияФинансовогоРезультата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаЗакупку</Name>
					<Comment>с клиентом, для расходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаПродажу</Name>
					<Comment>с поставщиком, для доходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВеденияБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьАвтогенерациюЗаявокНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/DataProcessors/CW_РеестрыНДС0ПакетноеФормированиеЗаписейРеестров/Ext/ManagerModule.bsl
Процедура ПолучитьСписокДокументов(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ТаблицаДокументов = ПараметрыПроцедуры.ТаблицаДокументов;

	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозкам.Контрагент КАК Контрагент,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК ДокументДоходов,
	               |	СУММА(CW_ДоходыПоГрузоперевозкам.Всего) КАК СуммаРеализацииРуб,
	               |	СУММА(ВЫБОР
	               |			КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	               |				ТОГДА ВЫБОР
	               |						КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	               |							ТОГДА CW_ДоходыПоГрузоперевозкам.Всего
	               |						ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Всего_Валюта
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	               |						ТОГДА CW_ДоходыПоГрузоперевозкам.Всего
	               |					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Всего_Валюта
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаРеализации,
	               |	ВЫБОР
	               |		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	               |			ТОГДА ВЫБОР
	               |					КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	               |						ТОГДА &ВалютаРегламентированногоУчета
	               |					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	               |					ТОГДА &ВалютаРегламентированногоУчета
	               |				ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Валюта
	               |ПОМЕСТИТЬ ВТ_Доходы
	               |ИЗ
	               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация = &Организация
	               |	И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт = ИСТИНА
	               |	И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчетФактура = ИСТИНА
	               |	И CW_ДоходыПоГрузоперевозкам.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |	И CW_ДоходыПоГрузоперевозкам.ПорядокОтражения В(&мПорядокОтражения)
	               |	И (CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ВедомыйДокумент <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |			ИЛИ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ВедомыйДокументКорректировки <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))
                   |	//УСЛОВИЕ_ПЕРИОД
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ДоходыПоГрузоперевозкам.Контрагент,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов,
	               |	ВЫБОР
	               |		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	               |			ТОГДА ВЫБОР
	               |					КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	               |						ТОГДА &ВалютаРегламентированногоУчета
	               |					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	               |					ТОГДА &ВалютаРегламентированногоУчета
	               |				ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Доходы.Контрагент КАК Контрагент,
	               |	ВТ_Доходы.ДокументДоходов КАК ДокументДоходов,
	               |	ВТ_Доходы.СуммаРеализации КАК СуммаРеализации,
	               |	ВТ_Доходы.СуммаРеализацииРуб КАК СуммаРеализацииРуб,
	               |	ВТ_Доходы.Валюта КАК Валюта
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |ГДЕ
	               |	ВТ_Доходы.СуммаРеализации <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЗаписиРеестра.ДокументДоходов КАК ДокументДоходов,
	               |	CW_РеестрыНДС0ЗаписиРеестра.Ссылка КАК ЗаписьРеестра,
	               |	CW_РеестрыНДС0ЗаписиРеестра.НалоговаяБаза КАК НалоговаяБаза,
	               |	CW_РеестрыНДС0ЗаписиРеестра.ТребуетсяЗаполнение КАК ТребуетсяЗаполнение
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра
	               |ГДЕ
	               |	CW_РеестрыНДС0ЗаписиРеестра.ПометкаУдаления = ЛОЖЬ
	               |	И CW_РеестрыНДС0ЗаписиРеестра.ДокументДоходов В
	               |			(ВЫБРАТЬ
	               |				ВТ_Доходы.ДокументДоходов КАК ДокументДоходов
	               |			ИЗ
	               |				ВТ_Доходы КАК ВТ_Доходы)
	               |	И CW_РеестрыНДС0ЗаписиРеестра.ПодтверждениеНДС <> ЗНАЧЕНИЕ(Перечисление.CW_РеестрыНДС0СтатусыЗаписиРеестра.НеПодтвержден)
	               |ИТОГИ
	               |	СУММА(НалоговаяБаза),
	               |	МАКСИМУМ(ТребуетсяЗаполнение)
	               |ПО
	               |	ДокументДоходов";
	
	Если ПараметрыПроцедуры.ВариантПериода = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ПЕРИОД", "И CW_ДоходыПоГрузоперевозкам.Период МЕЖДУ &НачалоПериода И &КонецПериода");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ПЕРИОД", "И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ДатаАкта МЕЖДУ &НачалоПериода И &КонецПериода");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", 		ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 		ПараметрыПроцедуры.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",  		ПараметрыПроцедуры.Организация);    
	Запрос.УстановитьПараметр("мПорядокОтражения",  мПорядокОтражения);    
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет(); 
	
	//1. Доходы
	РезультатДоходы = ПакетРезультатовЗапроса[1];  
	
	//2. Реестры
	РезультатРеестры = ПакетРезультатовЗапроса[2];
    ВыборкаРеестры = РезультатРеестры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаДоходы = РезультатДоходы.Выбрать();
	Пока ВыборкаДоходы.Следующий() Цикл   
		
		ВедомыйВедущий  = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(ВыборкаДоходы.ДокументДоходов);
		
		НоваяСтрока = ТаблицаДокументов.Добавить(); 
		
		НоваяСтрока.Контрагент 		= ВыборкаДоходы.Контрагент;  
		НоваяСтрока.ДокументДоходов = ВыборкаДоходы.ДокументДоходов; 
		
		НоваяСтрока.ВедомыйДокумент = ВедомыйВедущий.ВедомыйДокумент; 
		              
		НоваяСтрока.СуммаРеализации = CW_РеестрыНДС0Дополнительный.ПересчитатьСуммуРеализации(ВыборкаДоходы.СуммаРеализации, ВыборкаДоходы.СуммаРеализацииРуб, ВыборкаДоходы.Валюта, ВыборкаДоходы.ДокументДоходов);
 
		СтруктураОтбора = Новый Структура("ДокументДоходов",  ВыборкаДоходы.ДокументДоходов);
		
		ВыборкаРеестры.Сбросить();
		Если ВыборкаРеестры.НайтиСледующий(СтруктураОтбора) Тогда
			
			НоваяСтрока.НалоговаяБаза 		= ВыборкаРеестры.НалоговаяБаза;  
			НоваяСтрока.ТребуетсяЗаполнение = ВыборкаРеестры.ТребуетсяЗаполнение;  
			
			ВыборкаДетали = ВыборкаРеестры.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				НоваяСтрока.ЗаписиРеестра.Добавить(ВыборкаДетали.ЗаписьРеестра);
			КонецЦикла;
			
		КонецЕсли; 
		
		НоваяСтрока.Отклонение = НоваяСтрока.СуммаРеализации - НоваяСтрока.НалоговаяБаза ;  
		
	КонецЦикла;    
	
	ПоместитьВоВременноеХранилище(ТаблицаДокументов, АдресРезультата);
	
КонецПроцедуры

Процедура СформироватьЗаписиРеестровНДС(ПараметрыПроцедуры, АдресРезультата) Экспорт   

	ТаблицаДокументов = ПараметрыПроцедуры.ТаблицаДокументов; 
	
	Отбор   = Новый Структура("Выбор", Истина);
	мСтроки = ТаблицаДокументов.НайтиСтроки(Отбор);

	Для Каждого СтрокаТаблицы из мСтроки Цикл
		
		УдалитьЗаписиРеестров(СтрокаТаблицы.ЗаписиРеестра); 
		
		СписокВидыТранспорта = CW_РеестрыНДС0Дополнительный.ПолучитьСписокПриложенийПоДокументу(СтрокаТаблицы.ДокументДоходов);  
		МассивВидыТранспорта = СписокВидыТранспорта.ВыгрузитьЗначения();
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВедущийДокумент", 				СтрокаТаблицы.ДокументДоходов);
		СтруктураПараметров.Вставить("ВедомыйДокумент", 				СтрокаТаблицы.ВедомыйДокумент);
		СтруктураПараметров.Вставить("ВидыТранспорта", 					МассивВидыТранспорта);   
  		СтруктураПараметров.Вставить("ВариантПериодаПодтверждения", 	ПараметрыПроцедуры.ВариантПериодаПодтверждения);   
		СтруктураПараметров.Вставить("ПериодПодтверждения", 			ПараметрыПроцедуры.ПериодПодтверждения);   

		CW_РеестрыНДС0Дополнительный.СформироватьЗаписьРеестраНДС(СтруктураПараметров);	
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаДокументов, АдресРезультата);
	
КонецПроцедуры   

Процедура УдалитьЗаписиРеестров(СписокЗаписиРеестра) 
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ЭлементСписка из СписокЗаписиРеестра Цикл
		ЗаписьРеестраСсылка = ЭлементСписка.Значение;  
		
		ОбъектЗаписьРеестра = ЗаписьРеестраСсылка.ПолучитьОбъект(); 
		Если ОбъектЗаписьРеестра <> Неопределено Тогда
			Если Не ОбъектЗаписьРеестра.Заблокирован Тогда
				ОбъектЗаписьРеестра.Удалить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
